gistapp/app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses` ORDER BY created_at DESC
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN statuses ON statuses.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Status' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT statuses.id FROM `statuses` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
    @statuses = Status.order("created_at DESC") unless params[:tag]
    @statuses = Status.tagged_with(params[:tag].to_s,:on => :tags ,:any => true ) if params[:tag]
    if params[:time]
     @statuses =  @statuses.where(['created_at >= ? and created_at <= ?', params[:time], Time.zone.now.end_of_day])