gistapp/app/views/statuses/index.html.erb

SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN statuses ON statuses.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Status' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT statuses.id FROM `statuses` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
              <% end %>
              <% unless status.tag_list.blank? %>